/* Message of sheet displayed for CSSM_CERT_STATUS_EXPIRED. */
"The certificate for this server has expired. You might be connecting to a server that is pretending to be {0} which could put your confidential information at risk. Would you like to connect to the server anyway?" = "Tämän palvelimen sertifikaatti on vanhentunut. On mahdollista että yrität yhteyttä palvelimelle joka teskentelee olevansa  {0}, jolloin tietosi voivat olla vaarassa. Haluatko siitä huolimatta yhdistää palvelimelle?";

/* Message of sheet displayed for CSSM_CERT_STATUS_NOT_VALID_YET. */
"The certificate for this server is not yet valid. You might be connecting to a server that is pretending to be {0} which could put your confidential information at risk. Would you like to connect to the server anyway?" = "Tämän palvelimen sertifikaatti ei ole vielä voimassa. On mahdollista että yrität yhteyttä palvelimelle joka teskentelee olevansa {0}, jolloin tietosi voivat olla vaarassa. Haluatko siitä huolimatta yhdistää palvelimelle?";

/* Message of sheet displayed for !CSSM_CERT_STATUS_IS_IN_ANCHORS. */
"The certificate for this server is invalid. You might be connecting to a server that is pretending to be {0} which could put your confidential information at risk. Would you like to connect to the server anyway?" = "Tämän palvelimen sertifikaatti on virheellinen. On mahdollista että yrität yhteyttä palvelimelle joka teskentelee olevansa {0}, jolloin tietosi voivat olla vaarassa. Haluatko siitä huolimatta yhdistää palvelimelle?";

/* Message of sheet displayed for !CSSM_CERT_STATUS_IS_IN_ANCHORS && CSSM_CERT_STATUS_IS_ROOT */
"The certificate for this server was signed by an unknown certifying authority. You might be connecting to a server that is pretending to be {0} which could put your confidential information at risk. Would you like to connect to the server anyway?" = "Tämän palvelimen sertifikaatin myöntäjä on tuntematon. On mahdollista että yrität yhteyttä palvelimelle joka teskentelee olevansa {0}, jolloin tietosi voivat olla vaarassa. Haluatko siitä huolimatta yhdistää palvelimelle?";

/* Certificate trust verification prompt */
"Certificate Error" = "Varmennevirhe";
"Always Trust" = "Luota aina";
"Show Certificate" = "Näytä varmenne";

/* Remember password on Windows */
"Save Password" = "Tallenna salasana";

/* Client authentication with mutual SSL */
"The server requires a certificate to validate your identity. Select the certificate to authenticate yourself to {0}." = "Palvelin vaatii sertifikaatin, jotta se voi varmentaa henkilöllisyytesi. Valitse sertifikaatti varmentaaksesi itsesi palvelimelle {0}.";
